sep/cc-status-display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# DEBUG MODE: route ESP_LOGx to USB-Serial-JTAG so panic traces appear in
# `idf.py monitor`. This corrupts the data channel while the bridge is
# connected (log bytes interleave with our NDJSON), so flip back to
# CONFIG_ESP_CONSOLE_UART_DEFAULT=y once the bridge-kill hang is diagnosed
# and the spec-mandated channel separation is restored.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
